backGroundAndWing/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    wallsBackGround
    {
        //type            slip;
        type            uniformFixedValue;
        uniformValue    (0 0 0);
        //type            zeroGradient;
    }
    
    wallsTop
    {
        type            slip;
        //type            uniformFixedValue;
        //uniformValue    (0 0 0);
        //type            zeroGradient;
    }

    wallsWing
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    frontAndBackBackGround
    {
        type slip;
    }

    oversetPatch
    {
        type            overset;
    }
}

// ************************************************************************* //
