backGroundAndWing/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.24;

boundaryField
{
    oversetPatch
    {
        type            overset;
    }
    wallsWing
    {
        type            kqRWallFunction;
        value           uniform 0.24;
    }
    wallsBackGround
    {
        type            slip;
    }
    wallsTop
    {
        type            slip;
    }

    frontAndBackBackGround
    {
        type slip;
    }
   "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
