backGroundAndWing/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    oversetPatch
    {
        type            overset;
    }
    wallsBackGround
    {
        type            slip;
    }
    wallsWing
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    wallsTop
    {
        type            slip;
    }
    frontAndBackBackGround
    {
        type slip;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
